Step 1: Creating the Dataset

In [1]:
# !pip install pandas numpy matplotlib seaborn scikit-learn

In [2]:

student_id = []
subject = []
marks = []
attendance = []
semester = []

student_id.append("S1")
subject.append("Maths")
marks.append(78)
attendance.append(85)
semester.append(1)

checking the records

In [3]:
student_id, subject, marks, attendance, semester

(['S1'], ['Maths'], [78], [85], [1])

Inserting more records

In [4]:
student_id.append("S2")
subject.append("Science")
marks.append(88)
attendance.append(90)
semester.append(1)

student_id.append("S3")
subject.append("History")
marks.append(92)        
attendance.append(95)
semester.append(2)  

student_id.append("S4")
subject.append("Maths")
marks.append(67)
attendance.append(80)
semester.append(2)
student_id.append("S5")
subject.append("Science")   
marks.append(74)
attendance.append(88)
semester.append(1)
    
student_id.append("S6")
subject.append("History")
marks.append(81)
attendance.append(92)
semester.append(2)

student_id.append("S7")
subject.append("Maths")
marks.append(89)
attendance.append(87)
semester.append(1)

student_id.append("S8")
subject.append("Science")
marks.append(78)
attendance.append(85)
semester.append(2)

student_id.append("S9")
subject.append("History")
marks.append(95)
attendance.append(93)
semester.append(1)
student_id.append("S10")
subject.append("Maths")
marks.append(82)
attendance.append(88)
semester.append(2)

student_id.append("S11")
subject.append("Science")
marks.append(76)
attendance.append(84)
semester.append(1)

student_id.append("S12")
subject.append("History")
marks.append(90)
attendance.append(91)
semester.append(2)

student_id.append("S13")
subject.append("Maths")
marks.append(85)
attendance.append(89)
semester.append(1)
student_id.append("S14")
subject.append("Science")
marks.append(80)
attendance.append(86)
semester.append(2)

student_id.append("S15")
subject.append("History")
marks.append(88)
attendance.append(90)
semester.append(1)

In [5]:
student_id, subject, marks, attendance, semester

(['S1',
  'S2',
  'S3',
  'S4',
  'S5',
  'S6',
  'S7',
  'S8',
  'S9',
  'S10',
  'S11',
  'S12',
  'S13',
  'S14',
  'S15'],
 ['Maths',
  'Science',
  'History',
  'Maths',
  'Science',
  'History',
  'Maths',
  'Science',
  'History',
  'Maths',
  'Science',
  'History',
  'Maths',
  'Science',
  'History'],
 [78, 88, 92, 67, 74, 81, 89, 78, 95, 82, 76, 90, 85, 80, 88],
 [85, 90, 95, 80, 88, 92, 87, 85, 93, 88, 84, 91, 89, 86, 90],
 [1, 1, 2, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1])

Impoting required libraries

In [6]:

import pandas as pd
import numpy as np

# careating a dataframe ad inserting the data

In [7]:
df = pd.DataFrame({
    "student_id": student_id,
    "subject": subject,
    "marks": marks,
    "attendance": attendance,
    "semester": semester
})
df

   student_id  subject  marks  attendance  semester
0          S1    Maths     78          85         1
1          S2  Science     88          90         1
2          S3  History     92          95         2
3          S4    Maths     67          80         2
4          S5  Science     74          88         1
5          S6  History     81          92         2
6          S7    Maths     89          87         1
7          S8  Science     78          85         2
8          S9  History     95          93         1
9         S10    Maths     82          88         2
10        S11  Science     76          84         1
11        S12  History     90          91         2
12        S13    Maths     85          89         1
13        S14  Science     80          86         2
14        S15  History     88          90         1

# Exploring the data

In [8]:
df.dtypes

student_id    object
subject       object
marks          int64
attendance     int64
semester       int64
dtype: object

In [9]:
df.shape

(15, 5)

In [10]:
df.isna().sum()

student_id    0
subject       0
marks         0
attendance    0
semester      0
dtype: int64

In [11]:
df.describe()

           marks  attendance   semester
count  15.000000    15.00000  15.000000
mean   82.866667    88.20000   1.466667
std     7.623897     3.87667   0.516398
min    67.000000    80.00000   1.000000
25%    78.000000    85.50000   1.000000
50%    82.000000    88.00000   1.000000
75%    88.500000    90.50000   2.000000
max    95.000000    95.00000   2.000000

The dataset is clean, contains no missing values, and numeric columns are correctly typed. Since the data was manually created, no anomalies were observed

# Finding avg marks per subject

In [12]:
avg_marks = df.groupby("subject")["marks"].mean()
avg_marks

subject
History    89.2
Maths      80.2
Science    79.2
Name: marks, dtype: float64

## Finding the highest marks

In [13]:
highest_marks = df["marks"].max()
df.loc[df["marks"] == highest_marks]

  student_id  subject  marks  attendance  semester
8         S9  History     95          93         1

## MARKS LESS THAN 80

In [14]:
improvement_record= df[df["marks"] < 80]
improvement_record

   student_id  subject  marks  attendance  semester
0          S1    Maths     78          85         1
3          S4    Maths     67          80         2
4          S5  Science     74          88         1
7          S8  Science     78          85         2
10        S11  Science     76          84         1

## Why use numpy
### as numpy is faster for mathematical calculations compareds to pandas its very much efficient

# NumPy Operations on Marks

In [15]:
marks_array = np.asarray(df["marks"])
mean_marks = np.mean(marks_array)
median = np.median(marks_array)
sd = np.std(marks_array)
print(f"Median:{median}\nStandard Deviation:{sd}\nMean:{mean_marks}")

Median:82.0
Standard Deviation:7.365384503804869
Mean:82.86666666666666

In [16]:
df["marks"]

0     78
1     88
2     92
3     67
4     74
5     81
6     89
7     78
8     95
9     82
10    76
11    90
12    85
13    80
14    88
Name: marks, dtype: int64

## Assigning grades to the rows based on marks

In [17]:
grades = np.select(
    [df["marks"]>=95,df["marks"]>=90,df["marks"]>=85,df["marks"]>=80,df["marks"]>=75],
    ["A","B","C","D","E"],
    "F"
)
df["grades"] = grades

In [18]:
df

   student_id  subject  marks  attendance  semester grades
0          S1    Maths     78          85         1      E
1          S2  Science     88          90         1      C
2          S3  History     92          95         2      B
3          S4    Maths     67          80         2      F
4          S5  Science     74          88         1      F
5          S6  History     81          92         2      D
6          S7    Maths     89          87         1      C
7          S8  Science     78          85         2      E
8          S9  History     95          93         1      A
9         S10    Maths     82          88         2      D
10        S11  Science     76          84         1      E
11        S12  History     90          91         2      B
12        S13    Maths     85          89         1      C
13        S14  Science     80          86         2      D
14        S15  History     88          90         1      C

In [19]:
df["grades"].value_counts()

grades
C    4
E    3
D    3
B    2
F    2
A    1
Name: count, dtype: int64